# Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со
столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и
['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно
содержатся данные:
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники'],
[450, 300, 350, 500, 450, 370, 290]

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ['Тургенев', 'Чехов', 'Островский']
})

books = pd.DataFrame({
    'author_id':  [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой',
                   'Гроза', 'Таланты и поклонники'],
    'price':      [450, 300, 350, 500, 450, 370, 290]
})

# Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id

In [3]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [4]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

В данном случае все равно, какой join  брать, т.к. по author_id строки обоих датафреймов совпадают.

# Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими
книгами.

In [5]:
top5 = authors_price.sort_values(by="price",ascending=False).head(5)

In [6]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

# Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat
должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя
цена на книги этого автора.

In [7]:
def my_agg(x):
    names = {
        'min_price': x['price'].min(),
        'max_price':  x['price'].max(),
        'mean_price': x['price'].mean()
        }

    return pd.Series(names)


authors_stat = authors_price.groupby("author_name").apply(my_agg)

In [8]:
authors_stat.sort_values(by="author_name")

             min_price  max_price  mean_price
author_name
Островский       290.0      370.0  330.000000
Тургенев         300.0      450.0  366.666667
Чехов            450.0      500.0  475.000000